apache/nuttx/arch/xtensa/src/esp32/esp32_spi_slave.c
  spislv_dev = (struct spi_slave_ctrlr_s *)priv;

  flags = spin_lock_irqsave(&priv->lock);

  if ((volatile int)priv->refs != 0)
    {
      spin_unlock_irqrestore(&priv->lock, flags);

      return spislv_dev;
    }

  if (priv->config->use_dma)
    {
      priv->dma_chan = priv->config->dma_chan;
    }
  else
    {
      priv->dma_chan = 0;
    }

  /* Attach IRQ for CS pin interrupt */

  ret = esp_gpio_irq(priv->config->cs_pin,
                     esp32_io_interrupt,
                     priv);
  if (ret < 0)
    {
      spierr("esp_gpio_irq() failed: %d\n", ret);
      spin_unlock_irqrestore(&priv->lock, flags);
      return NULL;
    }

  /* Set up to receive peripheral interrupts on the current CPU */

  priv->cpu = this_cpu();
  priv->cpuint = esp_setup_irq(priv->config->periph,
                                 1,
                                 ESP_IRQ_TRIGGER_LEVEL,
                                 esp32_spislv_interrupt,
                                 priv);

  priv->refs++;

  spin_unlock_irqrestore(&priv->lock, flags);

  return spislv_dev;
}

/****************************************************************************
 * Name: esp32_spislv_ctrlr_uninitialize
 *
 * Description:
 *   Uninitialize an SPI slave bus
 *
 * Input Parameters:
 *   ctrlr - SPI slave controller interface instance
 *
 * Returned Value:
 *   OK if success or fail
 *
 ****************************************************************************/

int esp32_spislv_ctrlr_uninitialize(struct spi_slave_ctrlr_s *ctrlr)
{
  irqstate_t flags;
  struct esp32_spislv_priv_s *priv = (struct esp32_spislv_priv_s *)ctrlr;

  DEBUGASSERT(ctrlr);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);

  if (--priv->refs)
    {
      spin_unlock_irqrestore(&priv->lock, flags);
      return OK;
    }

  up_disable_irq(priv->config->irq);
  esp_teardown_irq(priv->config->periph, priv->cpuint);
  esp32_spislv_deinit(ctrlr);

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

#endif /* CONFIG_ESP32_SPI */
